app/controllers/docs_controller.rb

  def index #this is for index view, @docs = Doc.all.order("created_at DESC") ,order it in the time and day they were created,newest docs at the top and oldest at the bottom
    @docs = Doc.where(user_id: current_user) #now docs are visible to only user who created them
---
SELECT "docs".* FROM "docs" WHERE "docs"."user_id" = ?  [["user_id", 1]]

  def create #for creating something we need the create method, it doesn't have the view itself
    @doc = current_user.docs.build(doc_params) #we are creating this component
    #to  redirect to document itself
    if @doc.save
---
INSERT INTO "docs" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Why do we use it?"], ["content", "sada"], ["created_at", "2019-04-22 06:43:34.207861"], ["updated_at", "2019-04-22 06:43:34.207861"], ["user_id", 1]]

  def update #the same applies to the update as create, it just make changes to the database, using the edit voiew
    if @doc.update(doc_params)
---
UPDATE "docs" SET "content" = ?, "updated_at" = ? WHERE "docs"."id" = ?  [["content", "showwwww"], ["updated_at", "2019-04-22 12:47:23.935820"], ["id", 7]]

  def destroy #deleting the docs we create
    @doc.destroy
---
DELETE FROM "docs" WHERE "docs"."id" = ?  [["id", 12]]